tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "d12frosted/emacs-plus"
brew "kdoctor"
brew "libvterm"
brew "libtool"
brew "koekeishiya/formulae/yabai"
# TODO why does libgccjit have to be installed here and not in nix?
brew "libgccjit"
# TODO why do I have to install this separately with `brew install`?
# This is just here for documentation despite not working from scratch
# brew "emacs-plus", args: ["with-native-comp"]
brew "python@3.10"
cask "android-studio"
cask "bitwarden"
cask "brave-browser"
cask "clickup"
cask "google-chrome"
cask "google-drive"
cask "lulu"
cask "protonvpn"
cask "session"
cask "signal"
cask "teamviewer"
cask "zotero"
cask "spotify"
cask "raycast"
cask "slack"
cask "zoom"
cask "docker"
cask "discord"
